# Core taps used by selected packages.
tap "leoafarias/fvm"
tap "nikitabobko/tap"
tap "pear-devs/pear"

# Core CLI utilities.
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "aria2"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "gawk"
brew "htop"
brew "jq"
brew "lazygit"
brew "gitui"
brew "killport"
brew "mackup"
brew "rename"
brew "tmux"
brew "neovim"
brew "tree-sitter-cli"
brew "mas"

# Language and build tooling.
brew "cmake"
brew "ninja"
brew "ccache"
brew "cocoapods"
brew "nvm"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-build"
brew "rbenv"
brew "openjdk@17"
brew "openjdk@21"
brew "leoafarias/fvm/fvm"
brew "xcodes"
cask "xcodes-app"

# Mobile, embedded, and device tooling.
cask "android-commandlinetools"
cask "android-ndk"
cask "android-platform-tools"
cask "android-studio"
brew "gradle"
brew "scrcpy"
brew "minicom"

# Network and ops utilities.
brew "act"
brew "firebase-cli"
brew "nmap"
brew "rclone"
brew "smartmontools"
brew "speedtest-cli"
brew "wakeonlan"
brew "wireguard-tools"

# Media and document utilities.
brew "exiv2"
brew "ghostscript"
brew "imagemagick"
brew "media-info"
brew "mpv"
brew "tectonic"

# Terminals, editors, and dev apps.
cask "arc"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "fork"
cask "iterm2"
cask "orbstack"
cask "obsidian"
cask "pear-devs/pear/pear-desktop"
cask "postman"
cask "raycast"
cask "rectangle-pro"
cask "visual-studio-code"

# Mac App Store apps.
mas "PastePal", id: 1503446680
mas "WireGuard", id: 1451685025

# Window management and desktop utilities.
cask "aldente"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "keycastr"
cask "macs-fan-control"
cask "swiftformat-for-xcode"
cask "ticktick"

# Fonts and runtimes.
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "zulu@11"
cask "zulu@8"
